{
    "Worldwide Recipes": "Get recipes by author",
    "Nutrition by API-Ninjas": "API Ninjas Nutrition API endpoint.",
    "Store Groceries": "Search a specific grocery",
    "Real-Time Finance Data": "Get the latest news related to a specific currency / forex or crypto.",
    "Metals Prices Rates API": "The latest API endpoint will return real-time exchange rate data updated every 60 seconds.",
    "World Dive Centres Api": "The endpoint returns a json list of dive sites which match the region or country entered as the query. The range of results depend but there is usually around 100-500 sites for each country. There are around 15'000 dive sites listed in the database.",
    "East China News": "Filters Korean news from all sources",
    "Numbers Translator": "Numbers Translator",
    "IP Geolocation Metadata": "The API supports .csv",
    "TokopediaApi": "Search The Product",
    "Tokopedia Super API": "the list of available sorting methods",
    "Shoes collections": "This end point return the collection of shoes",
    "GeoSource API": "Retrives a list of  cities of the state.",
    "Referential": "Lookup sub-regions/states/provinces/departments by iso 3166-2 code",
    "Stadia Maps Time Zone API": "The Stadia TZ Lookup API provides time zone information",
    "climate data": "List of all Countries",
    "Flight Data_v2": "API returns a file with a list of cities from the database",
    "Skyscanner_v2": "Search for a place to get the **entityId** needed in searching the hotel API.",
    "Weather by API-Ninjas": "API Ninjas Weather API endpoint.",
    "Streaming Availability": "Get the id to name mapping of supported genres.",
    "Recipe Finder": "This API endpoint allows users to retrieve a random salad recipe that contains a specific ingredient. Users can make a GET request to the endpoint with the name of the ingredient as a query parameter",
    "League Of Legends Galore": "Get Player Details based on UserName.Case Sensitive!",
    "League Of Legends Esports": "In this method you can get all schedule for the leagues. You can filter multiple leagueId with join %  seperator.",
    "WNBA API": "This endpoint provides you with the WNBA scoreboard data for a specified date if available.",
    "World Weather Online API": "The Astronomy and Lunar API method allows you to access astronomy information for any given date.",
    "Ski Resort Forecast": "Returns the current snow conditions for a given resort name",
    "Dictionary": "With this service you can learn the meaning of words from Turkish dictionary.",
    "Word of the day": "Fetches upto 3 recent word from Dictionary.com",
    "Flight Radar": "List all airlines around the world",
    "TimeTable Lookup": "Returns the nearest airports for a given latitude and longitude",
    "Travel Hacking Tool": "This endpoint returns a list of airline alliances.",
    "BestBuy Product Data": "It will accept two parameters keyword and page.For Ex",
    "World Country": "Get Time Zone list",
    "World Time": "Request the current time for a specific IP (in plain text)",
    "IMDb": "Get all filmography of actor or actress",
    "Google News API": "Get",
    "Match APi": "Retrieve all competitions information",
    "Kubric": "The `/news/basic/search` endpoint allows you to search for movie news articles.",
    "Uncovered Treasure": "Get random treasure",
    "US Hospitals": "###Find US Hospitals by name.",
    "Recipe by API-Ninjas": "Get a list of recipes for a given search query. Returns at most 10 results. To access more than the first 10 results",
    "Feroeg - Reverse Geocoding": "Return a text address from a latitude/longitude location",
    "dev-to-api": "It returns all the week's top articles",
    "Health Calculator API": "This endpoint calculates the optimal distribution of macronutrients (carbohydrates",
    "Halsey Lyric Snippets": "This endpoint retrieves a random song from the specified album by the specified artist and returns it in the response.",
    "Numbers": "Get a fact about a day of year",
    "OikoWeather": "Hourly historical and forecast weather parameters in time-series format",
    "Airbnb listings": "Retrieve geographical admin names to be used in Listing by georef endpoint. admin* parameters are optional but to use admin2",
    "Advanced Movie Search": "Search a movie by query string",
    "Recipe Generator": "Uses AI to generate a unique recipe based on a provided name and a list of ingredients",
    "Ind Nutrient API": "This request allows clients to retrieve detailed information about a food item by filtering by query param `core`.Clients can include multiple cores in a single request. For example",
    "Ghana Food Recipe Api": "This endpoint gets all local drinks,image,ingredient and preparation.",
    "MusicData API": "Most viewed Youtube music videos weekly",
    "BingoAPI": "EU game spec.Returns numbers between 1 and 90.If you have a paid plan you can specify the number of cards to generate as a query parameter",
    "Movie and TV shows Quotes": "This endpoint will return back quotes by the given year",
    "Disposable Email Validation": "Validate can either be a domain ( **spam4.me** ) or an email address ( **badactor@spam4.me** )",
    "Disposable & Invalid Email Verifier": "This endpoint verifies the validity of an email address. It checks the email address format",
    "SoundCloud Scraper": "This endpoint lists the albums of a user. Pagination scraping is supported.",
    "Flixster": "Search for movies",
    "Current Affairs Of India": "This endpoint will fetch you today's current affair 10 quiz questions.",
    "Global WebServer  or IP Response Time and Location": "Connects to 12 global servers and determines the local ip at that location for a given domain name or ip address",
    "fast Email verifier": "Check whether or not you have a free domain.",
    "Email validator_v5": "This API will validate email with domain name",
    "Netflix_v2": "Search",
    "IceHockeyApi": "Get the schedules of ice hockey matches for a given date",
    "AI Weather by Meteosource": "**Severe weather alerts** for the USA",
    "PAC API": "This endpoint returns all newspaper artices for Trump",
    "WeatherAPI.com": "IP Lookup API method allows a user to get up to date information for an IP address in json.",
    "Spotify _v2": "Get new releases based on country code.",
    "Cartify": "This endpoint gets all products in the database.A list of products in the store",
    "Twelve Data": "This endpoint is a lightweight method that allows retrieving only the real-time price of the selected instrument.",
    "Ebay Search Result": "Enter anything you want to search for on Ebay website.",
    "FoodieFetch": "This endpoint allows users to retrieve menu location and ratings data for a specific restaurant. The user can send the name of the restaurant",
    "JP Funda": "### Return securities report data Specified by the date range.Note",
    "investing financial stocks": "get forex info",
    "Crypto Currency Scraper API": "The endpoint fetch the data of the top nft currencies including names and prices even rank and more!",
    "Lost Ark Simple": "Get List of Lost Ark Stronghold Item Recipes",
    "Lost Ark": "endpoint to get all abyssal dungeons",
    "IP Geolocation Lookup": "API returns location data such as country",
    "Easy Weather": "Get a 48-hour forecast for the given latitude and longitude.",
    "Scoring Tables API": "This retrieves all women's marks from the World Athletics Scoring Tables.",
    "FDJ": "Latest Odds for FDJ",
    "E-mail Check Invalid or Disposable Domain_v2": "Check if e-mail domain is valid",
    "BMI Calculator_v2": "Calculate BMI using weight and height.",
    "Great Circle Math Api": "Takes city",
    "Nomad List Cities": "Get Latin America cities sorted by overall score by default.Pagination",
    "Ambee Air Quality": "Check air quality for your postal code",
    "Koppen Climate Classification": "Get Koppen classification code for the given latitude and longitude.",
    "Tech Exams": "Returns all multiple choice and true or false questions with answers and feedback.",
    "Trackmania": "Get Players from nadeo.",
    "Beers List": "List of all beers",
    "E-mail Check Invalid": "Filter domain. Not start with a special character and must begin with a letter",
    "USPTO Trademark": "Returns info about the freshness of the Trademark Search API database.`last_update_date` holds the date of the newest entry from USPTO filling entries that is synced to the API. `latest_trademark` array holds 10 random samples from the most recent confirmed registered trademarks",
    "Cars image background removal": "The service provides three options for background removal results",
    "Vehicle charging stations": "Return nearest charging stations withinA POI (Point of Interest)",
    "India Pincode API": "findpincodebysubdistrict",
    "Timezone By API-Ninjas": "API Ninjas Timezone API endpoint. Returns the timezone name of the specified input location.Either both (**lat** and **lon**) or (**city**/**state**/**country**) parameters must be set.",
    "DietaGram": "Find food info by UPC (barcode)",
    "Body Mass Index (BMI) Calculator": "Retrieve the weight category of an individual based on their BMI",
    "News space": "Get Space News",
    "Fast Food Restaurants USA - TOP 50 Chains": "GET all {State} names",
    "Sephora": "List categories",
    "Handball Data": "List of tournaments in your data coverage.",
    "Recipe_v2": "Creative recipes. The API provides access to 231,637 creative recipes from all cuisines around the world.",
    "Calories Burned by API-Ninjas": "API Ninjas Calories Burned API endpoint.",
    "Patreon": "Search for Creators on Patreon using the `search_query`.",
    "BestBuy Product Data API": "It will accept two parameters keyword and page.For Ex",
    "Movie": "Monthly Top 100 Games Torrents",
    "Priceline com Provider": "Gets airport and city ids for the air product related to words in passed string.",
    "HM - Hennes Mauritz": "List all categories from H&M",
    "Google News": "This endpoint is used to get autocomplete suggestions or query predictions as a user types a search query. The endpoint requires the **keyword** parameter",
    "List Movies": "Sorts the results by choosen value",
    "Coronavirus Smartable": "Get the latest and historic coronavirus stats data (confirmed cases",
    "US Presidential Election": "Returns JSON block of results for One State",
    "Unofficial SHEIN": "Get detailed information of a country",
    "Business Starter API": "Generate a random Business name",
    "Cryptocurrency Markets": "Recently published cryptocurrencies videos.",
    "EarningsData": "Get earnings data by date.",
    "ExerciseDB": "Fetch a list of available body parts",
    "Emails Validator": "Allows validating email addresses. Checks if emails are deliverable.",
    "Unofficial Cricbuzz": "List teams",
    "Plant Hardiness Zone": "Pass a ZIP code in the endpoint path to return an object that includes the ZIP code and USDA Plant Hardiness Zone.",
    "Billboard API_v2": "Independent Albums chart is weekly based. If `week` is not supplied",
    "World Scuba Diving Sites Api": "The endpoint returns a json list of dive sites which match the region or country entered as the query. The range of results depend but there is usually around 100-500 sites for each country. There are around 15'000 dive sites listed in the database.",
    "Cameroon": "This endpoint returns information about the route between two locations in terms of distance",
    "Geography _v2": "get a list of all the continents filtering by name",
    "Schweizer Postleitzahlen": "get town information from ZIP-code (Postleitzahl)",
    "Tank01 NFL Live In-Game Real Time Statistics NFL": "Grabs all of this season's players and their IDs. ONE CALL is all you need to retrieve every player.  No need to call multiple times to get the full list.Rosters are updated multiple times per day during the season.You mainly will use this to match a player with his playerID.There are no parameters",
    "Covid-19 by API-Ninjas": "API Ninjas Covid19 API endpoint. Either **date** or **country** must be set.",
    "Pregnancy Calculator API": "This endpoint accepts a GET request to calculate the fertility window.",
    "Marvel Vs Capcom 2": "Access all characters in MVC2 (Marvel Vs Capcom) Universe",
    "Horostory": "retrieve the horoscope for a specific sign and date",
    "Pinnacle Odds": "Get a list of sports",
    "FachaAPI": "Get total live tracked aircraft",
    "Bildbet": "Latest Matches for Bildbet",
    "MMA Stats": "**Get details to UFC Fight Night",
    "Election2020 Smartable": "Get FAQs by topic.",
    "Drug Info and Price History": "Given a brand name",
    "Cocktails": "Get a random cocktail with all ingredients",
    "Rugby Live Data": "Lists active competitions available to query",
    "Ouranos": "7 Day Forecast return seeing value in arc seconds and transparency on a scale of 1 for the next 7 day every 3 hours",
    "Senegal API": "This endpoint allows you to perform reverse geocoding in Senegal by providing query parameters for latitude and longitude. It returns the name of the city where the location is located.",
    "Allah Name": "Get all name",
    "Canadian Gas Prices": "Returns the average price of gas in all Canadian provinces.",
    "MapReflex": "Get Counties boundaries in circle with given radius (in GeoJSON format). For a quick view",
    "Flixbus_v2": "Search for Flixbus stations",
    "Crypto News_v2": "Can take a single word search that will return any articles with the given keyword.",
    "News Network": "Return list of available regions.",
    "apimail10": "Current Mail",
    "OTT details": "Get array of values that can be used as params in Advanced Search .",
    "Global Ethereum Price Index - GEX": "Returns ticker data for specified symbol",
    "Pizza and Desserts": "This will return s all the desserts data",
    "Climate Change Live_v3": "This endpoint will return back  all news about the climate change from all over world.",
    "Fitness Calculator": "Knowing your daily calorie requirements is important to achieve your final goal. You can calculate your daily calorie req. for 7 different goals.",
    "Locations - Languages": "Minimized information of all countries",
    "Defi Data": "List of protocols along with their tvl",
    "Sportsbook Odds": "This returns the bets that have arbitrage and all bets that have low holds. It may be a bit confusing at the moment so if you have questions feel free to ask. Just as a basic overview",
    "webcams.travel": "This is a modifier. Returns a list of webcams according to the listed region. Multiple regions must be separated by comma. Required",
    "Weather API - By Any City": "This endpoint get all necessary weather information",
    "periodicTable": "It gives detailed information about elements in the periodic table.",
    "Kohls": "List stores near a provided GEO location",
    "IMDB_API": "Authentication",
    "Dice Roll Simulator": "Roll any number of regular dice any number of times.",
    "Climate Change API Tutorial": "This endpoint will return back all news about Climate Change from all over the world.",
    "Datamo": "This endpoint will return all the vehicle makes available",
    "InfoCarsAPI": "This endpoint will return back all the models of a respective car maker",
    "Miraisoft Training": "dashboard",
    "Realtime Crypto Prices": "Returns Realtime volume of a coin in US Dollars.",
    "Halal Korean Restaurants API": "Lists of halal restaurants in korea",
    "Air Quality": "Retrieves current air quality conditions for any location in the world",
    "Target": "Get suggestion by term or phrase",
    "Pictionary Charades Word Generator": "Get a random charades word with the specified difficulty. If not difficulty is supplied",
    "The Sandbox - SAND": "Get official news from Medium.",
    "NOAA Tides": "Get list of all NOAA stations that provide tide predictions to be used in other endpoints.",
    "Ebay": "Search for products on Ebay in specific country.Returns the `last_page` that can be scraped for the specific `search_query`.Default country is `United States`.Specify country with country name or country code.Allowed countries",
    "Moka News": "GET the recent 50 news",
    "Taxi Fare Calculator": "Search fares by geo coordinates",
    "My Store": "Get all products in the store",
    "India Today Unofficial": "All Latest news from India Today Platform",
    "Cocktail by API-Ninjas": "API Ninjas Cocktail API endpoint. Either **name** or **ingredients** parameter must be set.",
    "Countries": "This gets geo data on a country. Use ISO2 for country_code.",
    "Email finder": "Get email of anyone in the internet. Best for lead generation",
    "Used GPU Pricing": "Retrieves used prices of all GPUs",
    "Anime DB": "Get List of anime. You can search",
    "Billboard": "Billboard Global Excl. US. Available from SEPTEMBER 19",
    "Movies details": "We will provide movies details by title",
    "Political Bias Database": "get request that returns entire mediabiasfactcheck.com database as a json.",
    "Check Disposable Email": "REST API to lookup newly registered domains",
    "50K Radio Stations": "Get channel list",
    "Leo Github API Scraper": "Get list of Github repo for ruby web scrapping",
    "Leo Github Data Scraper": "Get list of Github repo for Ruby Webscrapping",
    "weather forecast 14 days": "Search location by Name or zip code and get the key for the forecast",
    "Business and company name API": "This endpoint gets all the companies and business as in the CAC database.",
    "mgs": "MGS Blogs",
    "Random Words": "Get multiple random words (i.e. min 2 and max 20) from a list of 5500+ words Important Notes",
    "Football (soccer) team names": "You'll get only the first 25 team names and their short names if you have basic plan.",
    "Football_v2": "Get a list of all available competitions",
    "Live Metal Prices": "Real-time Gold",
    "Veggie Me": "Aggregates all vegetarian restaurants from Yelp from London",
    "ALL Crypto News Feed": "Returns all feed.TweetsBlogsBinanceUsGov",
    "K-POP": "Get random boy-group",
    "Billboard_v2": "Get the Billboard 200 chart.",
    "Divanscore": "Get suggestions by term or phrase",
    "Motorcycles by API-Ninjas": "API Ninjas Motorcycles API endpoint. Returns up to 30 motorcycle results matching the input name parameters. For searches that yield > 30 results",
    "Income by Zipcode": "Income By Zipcode",
    "US Gas Prices": "Returns current gas price data for Alaska. Historical data starting from 2023-06-01 can be queried by adding the `date` parameter to this endpoint. In order to return XML instead of the default JSON format",
    "Betmaster": "Latest Odds by Betmaster.",
    "Ranked Crime Cities": "Ranked World Crime cities",
    "U.S. Economic Indicators": "Get monthly inflation rates.",
    "COVID-19 Economic Impact": "Get daily United States 7 day moving average percentage change in credit and debit card spending seasonally adjusted relative to January 4 - 31",
    "Location": "Get the cities.",
    "Billboard-API": "Provide the BILLBOARD 200 chart information",
    "Card Validator": "This endpoint create a fake and valid credit card number with desired length.",
    "Star Wars Characters": "Get all characters with all details",
    "Groundhog Day API": "Get all predictions for a given year.",
    "SureBets": "Get all available Surebets",
    "Stars API": "Returns the planets surrounding a star",
    "Indonesia News": "search detik.com news",
    "Gas Price": "The service that brings gas prices in the United States by state.",
    "Ikea API": "Obtain a list of all the countries and languages this API supports.",
    "Target.com Shopping - API": "Product autocompletion based on search keyword.",
    "NAVITIME Geocoding": "Return address information from postal code of request parameters.",
    "F1 Live Motorsport Data": "Lists available F1 seasons to query - starting point for the application.",
    "The Cancer Imaging Archive": "Set of all TCIA collection names",
    "Goverlytics": "fetch a list of politicians data",
    "Cities Cost of Living": "Get a list of all the Cities available",
    "NCAA Champions": "This endpoint retrieves NCAA championship data from 2000 until 2021",
    "Is This Coin A Scam": "Get a list of the most watched 100 crypto projects on isthiscoinascam.com over the past 7 days. Ordered by most most watched first.",
    "Hryvna Today": "History of average rates from banks",
    "Entity Risk": "List the available Sigma indicator categories to filter by.",
    "Ziff": "Get all Exchange Rates in alphabetical order; organised by Base Currency (also in alphabetical order).",
    "IP Geo Location and IP Reputation": "Format to display data",
    "Job Title Categorization": "Easily categorize any job title",
    "Climate Change Live_v27": "This endpoint will return back all news about Climate Change from all over the world.",
    "Investing": "Get Commodities",
    "yiwugo product data": "search products The source of the data can be controlled through the 'lan' field (en",
    "Deal Catcher": "Get rentals",
    "IEEE Spectrum API": "This endpoint will return back the latest 30 news from IEEE Spectrum website as JSON objects with 6 data elements. These will be the Title",
    "FIA Formula 1 Championship Statistics": "Use this endpoint to retrieve drivers standings data about a specifit F1 championship by specifying a year. If you ommit the ***year*** query parameter",
    "The Weather API": "Gives weather report of a particular city.",
    "SEPTA": "Regional Rail real-time train locations",
    "Indonesia Latest Weather and Earthquake": "Latest Top 15 Earthquake (felt by local)",
    "Distance Calculation API by Pizza API": "Calculate Distance between to place by their latitude and longitudes and metric you want the output of.",
    "Real-Time Quotes": "Returns the real time price of a forex currency pair",
    "GaiaLens Company Names": "This API returns a list of all company names available to the user. It can be used as a pre-step before invoking other GaiaLens APIs such as GaiaLens ESG Scores",
    "Pricer": "search by product name",
    "Betigolo Tips": "Historical result of Premium Tips in past 30 days",
    "Amazon_API_v2": "ll",
    "Chemical Elements": "This endpoint will return back data of all Chemical Elements of the periodic table",
    "Zoopla_v2": "Get auto complete suggestion by term or phrase",
    "Booking.com_v2": "Get currencies",
    "Sun Seeker API": "Parameters",
    "Simple TaxRate Retrieval": "Obtain tax rate by zip code",
    "Climate Change API_v3": "This endpoint will return all news about climate change from top news sites.",
    "Shazam": "Get suggestions by word or phrase",
    "MuscleWiki": "Get Attributes you can use to filter exercises",
    "Get Promo Codes": "Get Stores",
    "Narco in Mexico": "Get All Narco in Mexico News",
    "Generic Food_v2": "Get all foods",
    "Flixbus": "Get a list of cities",
    "ask-ai": "Ask question to AI Service. Be concise.",
    "Yummly": "Get auto complete suggestions by name or ingredients",
    "Dafabet": "Latest Odds for Dafabet",
    "New climate": "News from all publications",
    "Uganda Company Data": "Perform a search on the Uganda company register by name",
    "Generate a recipe based on an ingredient": "Generate your recipe for your use case or application!",
    "Betway": "Latest Matches for Betway",
    "Cbet": "Latest Matches for Cbet",
    "Taobao Tmall Product Detail": "Search products by keyword",
    "Recetas en español": "Get all recipes",
    "Currency Conversion and Exchange Rates": "Retrieve a list of all currently available currency symbols",
    "Australian postcode to suburb": "This endpoint will return all matching suburbs for the passed postcode. The response also includes the state for each suburb and",
    "Amazon Data_v2": "This endpoint point fetches categories of Amazon!",
    "BPS": "La liste des communes",
    "Currency Converter by API-Ninjas": "API Ninjas Convert Currency API endpoint.",
    "Comany Details Search Online": "Fetch Company Details by company name",
    "Air Quality by API-Ninjas": "API Ninjas Air Quality API endpoint.",
    "Booking com": "Get meta properties description",
    "US Zip Code Information": "This Endpoint returns the zip information",
    "Physical quantities": "This endpoint return back data of physical constants formatted as JSON",
    "Nearest Delhi Metro Station": "This endpoint is a **GET** method API that returns -- **Station name**- **Latitude** & **Longitude** of the nearest Delhi Metro station- **Google Maps direction**",
    "CasinoSearch": "Casino Tournaments List with details",
    "SBB Suisse railway": "Search for train and public transport stations in Switzerland and across Europe",
    "Hotels": "Get locale meta data",
    "Philippine News": "Get the latest news and stories from different sources",
    "KayuloWeather": "Determine the data sets available for the specified location.",
    "Tasty": "Get auto complete suggestions by name or ingredients",
    "msport": "*  list of future match up to next 7 days*  you can retrieve full list of soccer matches up to next 7 days",
    "Self-help Quotes": "List all available tags for the hand-picked self-help quotes",
    "Amazon Data Scraper _v2": "Get Amazon Search results",
    "Green Gold": "Endpoint to gather all articles from all listed publications detailed in API",
    "borders": "Returns all usa ports with description and wait times.",
    "Pharmacies de garde NC": "Renvoie les pharmacies de garde de Nouvelle-Caldonie",
    "Dreambet": "Latest Odds for Dreambet",
    "AI News_v2": "This endpoint will return back all news about artificial intelligence around the world",
    "AR VR News": "Get all news about AR and VR",
    "Malaysia Kini": "Return a list of current latest news article with info.",
    "Climate Change News_v5": "With this endpoint you can get all climate change news",
    "Admiralbet": "Latest Odds by Admiralbet.",
    "58 provinces of algeria": "all provinces",
    "Climate News API_v2": "This endpoint will return all news about Climate change from all around the world.",
    "Russian Premier League Standings": "Russian Premier League Standings",
    "Football Prediction": "List all available markets and the ones that are enabled for your subscription plan",
    "Facebook Marketplace": "Facebook items categories",
    "YH Finance Complete": "This endpoint retrieves a price with details for any public stock.",
    "Github API Scraper": "Get list of GitHub repo for Ruby web scrapping",
    "Yahoo Finance_v2": "Get stock SEC filings.",
    "Premier League Standings": "Premier League Standings",
    "Quotes": "Get a random Quote",
    "Viet Nam administrative divisions": "This endpoint will return back all names of cities in Vietnam",
    "Greek News in English": "This endpoint will return back all greek news from all the sources.",
    "Bet-at-Home": "Latest Odds by Bet-at-Home",
    "Bitcoin News": "This endpoint will return back all the news across all the major bitcoin news site from all over the world",
    "Reverse Geocoding_v3": "Translate locations on the map into human-readable addresses."
}